---
kind: type
id: T:Autodesk.Revit.DB.ElementSetIterator
source: html/cec6c2a8-b106-55cf-5d82-fc461333d5b3.htm
---
# Autodesk.Revit.DB.ElementSetIterator

An iterator to an element set.

## Syntax (C#)
```csharp
public abstract class ElementSetIterator : APIObject,
	IEnumerator
```